pmo-dataset/graphviz/55.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "Prepare implements";
  "Prepare implements" -> "Hand washing";
  "Hand washing" -> "Get in sterile\nclothes";
  "Get in sterile\nclothes" -> "Clean puncture area";
  "Clean puncture area" -> "Drap puncture zone";
  "Drap puncture zone" -> "Ultrasound\nconfiguration";
  "Ultrasound\nconfiguration" -> "Gel in probe";
  "Gel in probe" -> "Cover probe";
  "Cover probe" -> "Put sterile gel";
  "Put sterile gel" -> "Position probe";
  "Position probe" -> "Position patient";
  "Position patient" -> "Vein identification\nmethod";
  "Vein identification\nmethod" -> "Doppler\nidentification";
  "Vein identification\nmethod" -> "Anatomic\nidentification";
  "Vein identification\nmethod" -> "Compression\nidentification";
  "Doppler\nidentification" -> "ExclusiveGateway_1";
  "Anatomic\nidentification" -> "ExclusiveGateway_1";
  "Compression\nidentification" -> "ExclusiveGateway_1";
  "Anesthetize patient" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Puncture patient";
  "Puncture patient" -> "Check blood return";
  "ExclusiveGateway_1" -> "Anesthetize patient";
  "Drop probe" -> "Remove syringe";
  "Remove syringe" -> "Guidewire install";
  "Guidewire install" -> "Remove trocar";
  "Remove trocar" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Check wire in long\naxis";
  "ExclusiveGateway_3" -> "Check wire in short\naxis";
  "Check wire in long\naxis" -> "ExclusiveGateway_4";
  "Check wire in short\naxis" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Check wire position";
  "Check blood return" -> "Blood return correct\n?";
  "Check wire position" -> "Wire in good\nposition ?";
  "Blood return correct\n?" -> "ExclusiveGateway_2" [label="No"];
  "Wire in good\nposition ?" -> "ExclusiveGateway_2" [label="No"];
  "Blood return correct\n?" -> "Drop probe" [label="Yes"];
  "Wire in good\nposition ?" -> "Widen pathway" [label="Yes"];
  "Widen pathway" -> "Advance catheter";
  "Advance catheter" -> "Remove guidewire";
  "Remove guidewire" -> "Check flow and\nreflow";
  "Check flow and\nreflow" -> "Check catheter\nposition";
  "Check catheter\nposition" -> "EndNoneEvent";

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "Vein identification\nmethod" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "Blood return correct\n?" [shape=diamond];
  "Wire in good\nposition ?" [shape=diamond];
}
